policies/AM-BuildRequestMnpNokia.xml

<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<AssignMessage async="false" continueOnError="false" enabled="true" name="AM-BuildRequestMnpNokia">
    <DisplayName>AM-BuildRequestMnpNokia</DisplayName>
    <Add>
        <Headers>
            <Header name="Content-Type">text/xml; charset=utf-8</Header>
            <Header name="SOAPAction"/>
        </Headers>
    </Add>
    <Set>
        <Payload contentType="text/xml">
            <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soap="http://soapadapter.provgw">
                <soapenv:Header/>
                <soapenv:Body>
                    <spml:searchRequest xmlns:spml="urn:siemens:names:prov:gw:SPML:2:0" xmlns:subscriber="urn:siemens:names:prov:gw:ALTANMEXSUBSCRIBER:1:0" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" language="en_us">
                        <version>ALTANMEXSUBSCRIBER_v10</version>
                        <base>
                            <objectclass>Subscriber</objectclass>
                            <alias name="msisdn" value="52{msisdn}"/>
                        </base>
                    </spml:searchRequest>
                </soapenv:Body>
            </soapenv:Envelope>
        </Payload>
        <Verb>POST</Verb>
    </Set>
    <AssignTo createNew="true" transport="https" type="request">requestMnpNokia</AssignTo>
</AssignMessage>